* Ссылки [[~/org/sbcl/sbcl-referencies.org][Ссылки]]
* Генерирование документации
#+name: graphs
#+BEGIN_SRC lisp
  (defun make-document ()
    (loop
      :for i :in
      '((:mnas-logical :mnas-logical)
        )
      :do (apply #'mnas-package:document i)))

  (defun make-graphs ()
    (loop
      :for i :in
      '(:mnas-logical
        )
      :do (mnas-package:make-codex-graphs i i)))

  (defun make-all ()
        (make-document)
        (make-graphs)
        (codex:document :mnas-logical)
        (make-graphs))

      (make-all)
#+END_SRC

#+RESULTS: graphs
: NIL
* Публикация
#+name: publish
#+BEGIN_SRC shell :var graphs=graphs
    mkdir -p "$HOME/public_html/Common-Lisp-Programs/"
    CDIR=`dirname $PWD | xargs basename`
    rsync -Pazh --delete ../docs/build/$CDIR/html/ $HOME/public_html/Common-Lisp-Programs/$CDIR 
    if [[ `hostname` == "mnasoft-00" ]]
    then
	echo "mnasoft-00"
  #     sh ~/bin/pi-html
    fi
    if [[ `hostname` == "N000308" ]]
    then
	echo "N000308"
        CPL="//n133619/home/_namatv/public_html/Site/Development/Common-Lisp-Programs"
	mkdir -p $CPL/$CDIR
	rsync -Pazh --delete ../docs/build/$CDIR/html/ $CPL/$CDIR
     fi
#+END_SRC

#+RESULTS: publish
| sending                          | incremental | file | list       |         |   |        |      |            |         |          |               |
| deleting                         | api.html    |      |            |         |   |        |      |            |         |          |               |
| ./                               |             |      |            |         |   |        |      |            |         |          |               |
| call-graph-mnas-logical.gv       |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 65          | 100% | 0.00kB/s   | 0:00:00 |   |     65 | 100% | 0.00kB/s   | 0:00:00 | (xfr#1,  | to-chk=14/16) |
| call-graph-mnas-logical.gv.png   |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 5.63K       | 100% | 5.37MB/s   | 0:00:00 |   |  5.63K | 100% | 5.37MB/s   | 0:00:00 | (xfr#2,  | to-chk=13/16) |
| class-graph-mnas-logical.gv      |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 44          | 100% | 42.97kB/s  | 0:00:00 |   |     44 | 100% | 42.97kB/s  | 0:00:00 | (xfr#3,  | to-chk=12/16) |
| class-graph-mnas-logical.gv.png  |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 116         | 100% | 113.28kB/s | 0:00:00 |   |    116 | 100% | 113.28kB/s | 0:00:00 | (xfr#4,  | to-chk=11/16) |
| mnas-logical.html                |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 3.00K       | 100% | 2.86MB/s   | 0:00:00 |   |  3.00K | 100% | 2.86MB/s   | 0:00:00 | (xfr#5,  | to-chk=10/16) |
| symbol-graph-mnas-logical.gv     |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 44          | 100% | 42.97kB/s  | 0:00:00 |   |     44 | 100% | 42.97kB/s  | 0:00:00 | (xfr#6,  | to-chk=9/16)  |
| symbol-graph-mnas-logical.gv.png |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 116         | 100% | 113.28kB/s | 0:00:00 |   |    116 | 100% | 113.28kB/s | 0:00:00 | (xfr#7,  | to-chk=8/16)  |
| system-graph-mnas-logical.gv     |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 44          | 100% | 42.97kB/s  | 0:00:00 |   |     44 | 100% | 42.97kB/s  | 0:00:00 | (xfr#8,  | to-chk=7/16)  |
| system-graph-mnas-logical.gv.png |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 116         | 100% | 113.28kB/s | 0:00:00 |   |    116 | 100% | 113.28kB/s | 0:00:00 | (xfr#9,  | to-chk=6/16)  |
| графы-mnas-logical.html          |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 1.90K       | 100% | 1.81MB/s   | 0:00:00 |   |  1.90K | 100% | 1.81MB/s   | 0:00:00 | (xfr#10, | to-chk=5/16)  |
| обзор.html                       |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 1.76K       | 100% | 1.68MB/s   | 0:00:00 |   |  1.76K | 100% | 1.68MB/s   | 0:00:00 | (xfr#11, | to-chk=4/16)  |
| static/                          |             |      |            |         |   |        |      |            |         |          |               |
| static/highlight.css             |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 1.57K       | 100% | 1.50MB/s   | 0:00:00 |   |  1.57K | 100% | 1.50MB/s   | 0:00:00 | (xfr#12, | to-chk=2/16)  |
| static/highlight.js              |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 22.99K      | 100% | 21.92MB/s  | 0:00:00 |   | 22.99K | 100% | 21.92MB/s  | 0:00:00 | (xfr#13, | to-chk=1/16)  |
| static/style.css                 |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 4.32K       | 100% | 4.12MB/s   | 0:00:00 |   |  4.32K | 100% | 4.12MB/s   | 0:00:00 | (xfr#14, | to-chk=0/16)  |
| N000308                          |             |      |            |         |   |        |      |            |         |          |               |
| sending                          | incremental | file | list       |         |   |        |      |            |         |          |               |
| deleting                         | api.html    |      |            |         |   |        |      |            |         |          |               |
| ./                               |             |      |            |         |   |        |      |            |         |          |               |
| call-graph-mnas-logical.gv       |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 65          | 100% | 0.00kB/s   | 0:00:00 |   |     65 | 100% | 0.00kB/s   | 0:00:00 | (xfr#1,  | to-chk=14/16) |
| call-graph-mnas-logical.gv.png   |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 5.63K       | 100% | 5.37MB/s   | 0:00:00 |   |  5.63K | 100% | 5.37MB/s   | 0:00:00 | (xfr#2,  | to-chk=13/16) |
| class-graph-mnas-logical.gv      |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 44          | 100% | 42.97kB/s  | 0:00:00 |   |     44 | 100% | 42.97kB/s  | 0:00:00 | (xfr#3,  | to-chk=12/16) |
| class-graph-mnas-logical.gv.png  |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 116         | 100% | 113.28kB/s | 0:00:00 |   |    116 | 100% | 113.28kB/s | 0:00:00 | (xfr#4,  | to-chk=11/16) |
| mnas-logical.html                |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 3.00K       | 100% | 2.86MB/s   | 0:00:00 |   |  3.00K | 100% | 2.86MB/s   | 0:00:00 | (xfr#5,  | to-chk=10/16) |
| symbol-graph-mnas-logical.gv     |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 44          | 100% | 42.97kB/s  | 0:00:00 |   |     44 | 100% | 42.97kB/s  | 0:00:00 | (xfr#6,  | to-chk=9/16)  |
| symbol-graph-mnas-logical.gv.png |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 116         | 100% | 113.28kB/s | 0:00:00 |   |    116 | 100% | 113.28kB/s | 0:00:00 | (xfr#7,  | to-chk=8/16)  |
| system-graph-mnas-logical.gv     |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 44          | 100% | 2.86kB/s   | 0:00:00 |   |     44 | 100% | 2.86kB/s   | 0:00:00 | (xfr#8,  | to-chk=7/16)  |
| system-graph-mnas-logical.gv.png |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 116         | 100% | 7.55kB/s   | 0:00:00 |   |    116 | 100% | 7.55kB/s   | 0:00:00 | (xfr#9,  | to-chk=6/16)  |
| графы-mnas-logical.html          |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 1.90K       | 100% | 123.89kB/s | 0:00:00 |   |  1.90K | 100% | 123.89kB/s | 0:00:00 | (xfr#10, | to-chk=5/16)  |
| обзор.html                       |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 1.76K       | 100% | 114.84kB/s | 0:00:00 |   |  1.76K | 100% | 114.84kB/s | 0:00:00 | (xfr#11, | to-chk=4/16)  |
| static/                          |             |      |            |         |   |        |      |            |         |          |               |
| static/highlight.css             |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 1.57K       | 100% | 102.28kB/s | 0:00:00 |   |  1.57K | 100% | 102.28kB/s | 0:00:00 | (xfr#12, | to-chk=2/16)  |
| static/highlight.js              |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 22.99K      | 100% | 1.46MB/s   | 0:00:00 |   | 22.99K | 100% | 1.46MB/s   | 0:00:00 | (xfr#13, | to-chk=1/16)  |
| static/style.css                 |             |      |            |         |   |        |      |            |         |          |               |
|                                  | 4.32K       | 100% | 281.38kB/s | 0:00:00 |   |  4.32K | 100% | 281.38kB/s | 0:00:00 | (xfr#14, | to-chk=0/16)  |
